OpenDTEF-v1812/tutorials/incompressible/simpleFoam/pipeCyclic/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication topoSet
runApplication refineHexMesh c0 -overwrite

restore0Dir

#runApplication $(getApplication)
runApplication decomposePar -cellDist
runParallel $(getApplication)

runApplication reconstructPar

#------------------------------------------------------------------------------
